test_cases/single_phase_approach/simulation/system/limitFields
limitFields
{
    // Mandatory entries (unmodifiable)
    type            limitFields;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields          (s1 s2 s3);
    limit           both;
    min             0;
    max             1;
    writeControl    writeTime;
    writeInterval   1;
}
